In [1]:
import IPython

import psycopg2 as pg
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

Как выглядит ERD:

In [102]:

src="https://drawsql.app/teams/erd-mainor/diagrams/marketplace-erd/embed"

IPython.display.IFrame(src, width="100%",
height="500px",
style="box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); border-radius:15px;",
allowtransparency="true", 
allowfullscreen="true", 
scrolling="no", 
title="Embedded DrawSQL IFrame", 
frameborder="0")

In [3]:
%load_ext sql

In [4]:
host = 'localhost'
database = 'Marketplace_ERD'
user = 'hw_check'
password = 'X7pl2'

connection_string = f'postgresql://{user}:{password}@{host}/{database}'

In [5]:
%sql $connection_string

### Создание БД:

In [29]:
%%sql

CREATE TABLE Order_status(
    id INTEGER NOT NULL,
    order_id INTEGER NOT NULL,
    status_id INTEGER NOT NULL,
    date_of_status DATE NOT NULL
);
ALTER TABLE
    Order_status ADD PRIMARY KEY(id);
CREATE TABLE Status(
    id INTEGER NOT NULL,
    status VARCHAR(30) NOT NULL
);
ALTER TABLE
    Status ADD PRIMARY KEY(id);
CREATE TABLE Order_description(
    id INTEGER NOT NULL,
    description VARCHAR(30) NULL,
    type_of_delivery VARCHAR(30) NOT NULL
);
ALTER TABLE
    Order_description ADD PRIMARY KEY(id);
CREATE TABLE Orders(
    id INTEGER NOT NULL,
    description_id INTEGER NOT NULL,
    client_id INTEGER NOT NULL,
    product_id INTEGER NOT NULL,
    amount INTEGER NOT NULL,
    payment INTEGER NOT NULL
);
ALTER TABLE
    Orders ADD PRIMARY KEY(id);
CREATE TABLE Address(
    id INTEGER NOT NULL,
    address VARCHAR(30) NOT NULL,
    city_id INTEGER NOT NULL,
    client_id INTEGER NOT NULL,
    days_delivery INTEGER NOT NULL
);
ALTER TABLE
    Address ADD PRIMARY KEY(id);
CREATE TABLE Clients(
    id INTEGER NOT NULL,
    client_name VARCHAR(30) NOT NULL,
    telephone VARCHAR(12) NOT NULL
);
ALTER TABLE
    Clients ADD PRIMARY KEY(id);
CREATE TABLE Products(
    id INTEGER NOT NULL,
    category_id INTEGER NOT NULL,
    store_id INTEGER NOT NULL,
    price INTEGER NOT NULL,
    amount INTEGER NOT NULL,
    title VARCHAR(30) NOT NULL
);
ALTER TABLE
    Products ADD PRIMARY KEY(id);
CREATE TABLE City(
    id INTEGER NOT NULL,
    city_name VARCHAR(30) NOT NULL,
    sellers_amount INTEGER NOT NULL
);
ALTER TABLE
    City ADD PRIMARY KEY(id);
CREATE TABLE Sellers(
    id INTEGER NOT NULL,
    store_name VARCHAR(30) NOT NULL,
    city_id INTEGER NOT NULL
);
ALTER TABLE
    Sellers ADD PRIMARY KEY(id);
CREATE TABLE Category(
    id INTEGER NOT NULL,
    category_name VARCHAR(30) NOT NULL
);
ALTER TABLE
    Category ADD PRIMARY KEY(id);
ALTER TABLE
    Order_status ADD CONSTRAINT order_status_order_id_foreign FOREIGN KEY(order_id) REFERENCES Orders(id);
ALTER TABLE
    Order_status ADD CONSTRAINT order_status_status_id_foreign FOREIGN KEY(status_id) REFERENCES Status(id);
ALTER TABLE
    Orders ADD CONSTRAINT order_description_id_foreign FOREIGN KEY(description_id) REFERENCES Order_description(id);
ALTER TABLE
    Orders ADD CONSTRAINT order_client_id_foreign FOREIGN KEY(client_id) REFERENCES Clients(id);
ALTER TABLE
    Orders ADD CONSTRAINT order_product_id_foreign FOREIGN KEY(product_id) REFERENCES Products(id);
ALTER TABLE
    Address ADD CONSTRAINT address_city_id_foreign FOREIGN KEY(city_id) REFERENCES City(id);
ALTER TABLE
    Address ADD CONSTRAINT address_client_id_foreign FOREIGN KEY(client_id) REFERENCES Clients(id);
ALTER TABLE
    Products ADD CONSTRAINT products_store_id_foreign FOREIGN KEY(store_id) REFERENCES Sellers(id);
ALTER TABLE
    Sellers ADD CONSTRAINT sellers_city_id_foreign FOREIGN KEY(city_id) REFERENCES City(id);
ALTER TABLE
    Products ADD CONSTRAINT products_category_id_foreign FOREIGN KEY(category_id) REFERENCES Category(id);

 * postgresql://hw_check:***@localhost/Marketplace_ERD
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Добавление данных:

In [30]:
%%sql

insert into Category(id, category_name) values
    (1, 'Электроника'),
    (2, 'Одежда'),
    (3, 'Мебель');
    
    
insert into City(id, city_name, sellers_amount) values
    (1, 'Moscow', 5),
    (2, 'SPB', 2),
    (3, 'Kazan', 2);
    

insert into Sellers(id, store_name, city_id) values
    (1, 'Xiaomi', 1),
    (2, 'Samsung', 1),
    (3, 'Adidas', 2),
    (4, 'GJ', 1),
    (5, 'LEVIS', 1),
    (6, 'Ormatek', 2),
    (7, 'Sokoltec', 1),
    (8, 'Samsung', 3),
    (9, 'Xiaomi', 3);
    
    
insert into Products(id, category_id, store_id, price, amount, title) values
    (1, 1, 1, 8235, 56, 'Xiaomi Redmi 9C 3/64'),
    (2, 1, 1, 25999, 14, 'Xiaomi MI TV P1 43'),
    (3, 1, 9, 25999, 14, 'Xiaomi MI TV P1 43'),
    (4, 1, 9, 4369, 5, 'Xiaomi Redmi Watch 2 Lite GL'),
    
    (5, 1, 2, 64063, 34, 'Samsung Galaxy S22'),
    (6, 1, 8, 86025, 22, 'Samsung Galaxy Tab S8 Ultra'),
    
    (7, 2, 3, 29999, 3, 'adidas 4DFWD'),
    (8, 2, 3, 6399, 3, 'adidas Ultimashow'),
    (9, 2, 4, 3047, 42, 'Jeans tlx'),
    (10, 2, 4, 5831, 2, 'Hoodie xt4'),
    (11, 2, 5, 4900, 12, 'New LEVIS HM polo'),
    (12, 2, 5, 2088, 57, 'LEVIS Turner'),
    (13, 2, 5, 23180, 11, 'Coat LEVIS'),
    
    (14, 3, 6, 47189, 93, 'Optima Classic'),
    (15, 3, 6, 3948, 173, 'Ormatek SLEEP'),
    (16, 3, 7, 5469, 1155, 'Chair set x2'),
    (17, 3, 7, 6691, 119, 'Gaiming chair sokt'),
    (18, 3, 7, 3521, 109, 'Desk table');
    

insert into Clients(id, client_name, telephone) values
    (1, 'N - U Ludi', +79951853464),
    (2, 'Gunnar', +79851196212),
    (3, 'Square bit', +79341476919),
    (4, 'Ni La Da', +79301992030),
    (5, 'Silkovsky', +7910181724);
    
    
insert into Address(id, address, city_id, client_id, days_delivery) values
    (1, 'Malaya Bronnaya St, 31', 1, 1, 1),
    (2, 'Monetchikovskiy Pereulok, 81', 1, 2, 1),
    (3, 'Monetchikovskiy Pereulok, 29', 1, 3, 2),
    (4, 'Myasnitskaya Ulitsa, 63', 2, 4, 2),
    (5, 'Taganskaya Ulitsa, 16', 3, 5, 4);
    

insert into Order_description(id, description, type_of_delivery) values
    (1, 'Первая половина дня', 'To_household'),
    (2, 'Вторая половина дня', 'To_household'),
    (3, 'Без разницы', 'To_household'),
    (4, null, 'To_postamat');
    

insert into Orders(id, description_id, client_id, product_id, amount, payment) values
    (1, 1, 1, 2, 1, 25999),
    (2, 1, 1, 5, 2, 128126),
    (3, 4, 2, 13, 1, 23180),
    (4, 4, 3, 7, 1, 29999),
    (5, 4, 3, 8, 1, 6399),
    (6, 2, 4, 14, 1, 47189),
    (7, 2, 4, 15, 1, 3948),
    (8, 4, 5, 5, 4, 256252),
    (9, 4, 5, 6, 2, 172050),
    (10, 4, 1, 16, 15, 82035);
    
    
insert into Status(id, status) values
    (1, 'Перемещено в корзину'),
    (2, 'Оплачено'),
    (3, 'Запрошен возврат');
    
    
insert into Order_status(id, order_id, status_id, date_of_status) values
    (1, 1, 1, '2022-12-05'),
    (2, 1, 2, '2022-12-07'),
    (3, 2, 1, '2022-12-08'),
    (4, 2, 2, '2022-12-15'),
    (5, 3, 1, '2022-12-05'),
    (6, 3, 2, '2022-12-05'),
    (7, 3, 3, '2022-12-06'),
    (8, 4, 1, '2022-12-05'),
    (9, 4, 2, '2022-12-05'),
    (10, 5, 1, '2022-12-06'),
    (11, 6, 1, '2022-12-07'),
    (12, 7, 1, '2022-12-08'), 
    (13, 7, 2, '2022-12-11'),
    (14, 7, 3, '2022-12-12'),
    (15, 8, 1, '2022-12-06'),
    (16, 9, 1, '2022-12-07'),
    (17, 10, 1, '2022-12-06');

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.
3 rows affected.
9 rows affected.
18 rows affected.
5 rows affected.
5 rows affected.
4 rows affected.
10 rows affected.
3 rows affected.
17 rows affected.

[]

### Выполнение запросов:

1) Вывести все заказы пользователя с именем 'N - U Ludi'

In [31]:
%%sql
    
select client_name, o.id order_id, description_id, product_id, amount, payment
from Clients c left join Orders o on c.id = o.client_id
where client_name = 'N - U Ludi'

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.

[('N - U Ludi', 1, 1, 2, 1, 25999),
 ('N - U Ludi', 2, 1, 5, 2, 128126),
 ('N - U Ludi', 10, 4, 16, 15, 82035)]

2) Вывести суммарные траты каждого пользователя в порядке убывания

In [32]:
%%sql

select client_name, sum(payment)
from Clients c left join Orders o on c.id = o.client_id
group by client_name
order by 2 desc

 * postgresql://hw_check:***@localhost/Marketplace_ERD
5 rows affected.

[('Silkovsky', 428302),
 ('N - U Ludi', 236160),
 ('Ni La Da', 51137),
 ('Square bit', 36398),
 ('Gunnar', 23180)]

3) Вывести самый дорогой заказ с его стоимостью

In [33]:
%%sql

with t1 as ( 
    select o.id order_id, max(payment) ans
    from Orders o 
    group by id
)

select order_id, ans from t1 where ans = (select max(ans) from t1)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[(8, 256252)]

4) Вывести из какого продукта состоял самый дорогой заказ, полученный в вопросе 3

In [34]:
%%sql

with t1 as ( 
    select o.id order_id, max(payment) ans
    from Orders o
    group by id
),

t2 as (
    select order_id, ans 
    from t1 
    where ans = (select max(ans) from t1)
)

select title, o.amount from Orders o left join Products p on o.product_id = p.id
where o.id = (select order_id from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[('Samsung Galaxy S22', 4)]

5) Вывести сколько покупок было сделано в каждую дату

In [48]:
%%sql

with t1 as (
    select order_id
    from Order_status os
    where status_id = 2
    group by order_id

    except 

    select order_id
    from Order_status os
    where status_id = 3
    group by order_id)


select date_of_status as date, count(t1.order_id) 
from Order_status os left join t1 on os.order_id = t1.order_id and os.status_id = 2
group by date_of_status
order by 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
7 rows affected.

[(datetime.date(2022, 12, 5), 1),
 (datetime.date(2022, 12, 6), 0),
 (datetime.date(2022, 12, 7), 1),
 (datetime.date(2022, 12, 8), 0),
 (datetime.date(2022, 12, 11), 0),
 (datetime.date(2022, 12, 12), 0),
 (datetime.date(2022, 12, 15), 1)]

#### Еще один способ:

In [47]:
%%sql

select date_of_status as date, count(t1.order_id)
from (
    select order_id
    from Order_status os
    group by order_id
    having max(status_id) = 2
)t1 

right join Order_status os on t1.order_id = os.order_id and os.status_id = 2
group by date_of_status
order by 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
7 rows affected.

[(datetime.date(2022, 12, 5), 1),
 (datetime.date(2022, 12, 6), 0),
 (datetime.date(2022, 12, 7), 1),
 (datetime.date(2022, 12, 8), 0),
 (datetime.date(2022, 12, 11), 0),
 (datetime.date(2022, 12, 12), 0),
 (datetime.date(2022, 12, 15), 1)]

6) Вывести какие покупки были добавлены в корзину, но не оплачены

In [53]:
%%sql

with t1 as (
    select order_id
    from Order_status os
    group by order_id
    having max(status_id) = 1
)

select t1.order_id, title, o.amount, payment
from Orders o right join t1 on o.id = t1.order_id 
left join Products p on o.product_id = p.id

 * postgresql://hw_check:***@localhost/Marketplace_ERD
5 rows affected.

[(9, 'Samsung Galaxy Tab S8 Ultra', 2, 172050),
 (5, 'adidas Ultimashow', 1, 6399),
 (10, 'Chair set x2', 15, 82035),
 (6, 'Optima Classic', 1, 47189),
 (8, 'Samsung Galaxy S22', 4, 256252)]

7) Из какой категории было совершено больше всего покупок, а из какой меньше всего

In [57]:
%%sql

with t1 as (
    select o.id 
    from Orders o inner join Order_status os on o.id = os.order_id 
    group by o.id
    having max(status_id) = 2
),

t2 as (
    select category_name, count(*) ans
    from Category c left join Products p on c.id = p.category_id
    left join Orders o on p.id = o.product_id
    where o.id in (select * from t1)
    group by category_name
    order by 2 desc
)

select category_name, ans qty
from t2 where ans = (select max(ans) from t2) 
or ans = (select min(ans) from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
2 rows affected.

[('Электроника', 2), ('Одежда', 1)]

8) Вывести самые популярные магазины (у которых совершено больше всего покупок)

In [59]:
%%sql

with t1 as (
    select o.id 
    from Orders o inner join Order_status os on o.id = os.order_id 
    group by o.id
    having max(status_id) = 2
), 

t2 as (
    select store_name, count(*) c1
    from Sellers s left join Products p on s.id = p.store_id
    inner join Orders o on p.id = o.product_id
    where o.id in (select * from t1)
    group by store_name
)

select store_name from t2 where c1 = (select max(c1) from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.

[('Adidas',), ('Samsung',), ('Xiaomi',)]

#### Еще один способ:

In [98]:
%%sql

select store_name
from(
    select store_name, count(t1.c1) ans
    from (
        select o.id c1, product_id pp
        from Orders o inner join Order_status os on o.id = os.order_id
        group by c1, pp
        having max(status_id) = 2
    )t1 inner join Products p on t1.pp = p.id right join Sellers s on p.store_id = s.id
    group by store_name
)t2
order by ans DESC
fetch first 1 rows with ties

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.

[('Samsung',), ('Adidas',), ('Xiaomi',)]

9) Самый прибыльный магазин

In [100]:
%%sql

with t1 as (
    select o.id 
    from Orders o inner join Order_status os on o.id = os.order_id 
    group by o.id
    having max(status_id) = 2
)

select store_name, sum(payment)
from Sellers s left join Products p on s.id = p.store_id
left join Orders o on p.id = o.product_id
where o.id in (select * from t1)
group by store_name
order by 2 DESC
limit 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[('Samsung', 128126)]

#### Еще один способ:

In [126]:
%%sql

select store_name, sum(payment)
from Sellers s left join Products p on s.id = p.store_id
left join Orders o on p.id = o.product_id
where o.id in (
    select o.id from Orders o inner join Order_status os on o.id = os.order_id 
    group by o.id having max(status_id) = 2)

group by store_name
order by 2 DESC
limit 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[('Samsung', 128126)]

---